ab-tests/pokijan.jpg/ab_multiprocessing_c10.txt
C:\xampp\apache\bin>ab -n 1000 -c 10 -s 86400 http://192.168.2.19:20001/pokijan.jpg
This is ApacheBench, Version 2.3 <$Revision: 1879490 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 192.168.2.19 (be patient)
Completed 100 requests
Completed 200 requests
Completed 300 requests
Completed 400 requests
Completed 500 requests
Completed 600 requests
Completed 700 requests
Completed 800 requests
Completed 900 requests
Completed 1000 requests
Finished 1000 requests


Server Software:        myserver/1.0
Server Hostname:        192.168.2.19
Server Port:            20001

Document Path:          /pokijan.jpg
Document Length:        15706 bytes

Concurrency Level:      10
Time taken for tests:   1041.851 seconds
Complete requests:      1000
Failed requests:        32
   (Connect: 0, Receive: 0, Length: 32, Exceptions: 0)
Total transferred:      15338928 bytes
HTML transferred:       15203408 bytes
Requests per second:    0.96 [#/sec] (mean)
Time per request:       10418.508 [ms] (mean)
Time per request:       1041.851 [ms] (mean, across all concurrent requests)
Transfer rate:          14.38 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    1   0.9      1       9
Processing:     6 9974 25356.5   2322  227090
Waiting:        0 5556 10764.4   1864   77244
Total:          6 9975 25356.5   2323  227090

Percentage of the requests served within a certain time (ms)
  50%   2323
  66%   4852
  75%   7670
  80%   9846
  90%  16889
  95%  43082
  98%  132063
  99%  133122
 100%  227090 (longest request)