ab-tests/pokijan.jpg/ab_multiprocessing_c100.txt
C:\xampp\apache\bin>ab -n 1000 -c 100 -s 86400 http://192.168.2.19:20001/rfc2616.pdf
This is ApacheBench, Version 2.3 <$Revision: 1879490 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 192.168.2.19 (be patient)
Completed 100 requests
Completed 200 requests
Completed 300 requests
Completed 400 requests
Completed 500 requests
Completed 600 requests
Completed 700 requests
Completed 800 requests
Completed 900 requests
Completed 1000 requests
Finished 1000 requests


Server Software:        myserver/1.0
Server Hostname:        192.168.2.19
Server Port:            20001

Document Path:          /rfc2616.pdf
Document Length:        550562 bytes

Concurrency Level:      100
Time taken for tests:   484.115 seconds
Complete requests:      1000
Failed requests:        219
   (Connect: 0, Receive: 0, Length: 219, Exceptions: 0)
Total transferred:      430102948 bytes
HTML transferred:       429988922 bytes
Requests per second:    2.07 [#/sec] (mean)
Time per request:       48411.550 [ms] (mean)
Time per request:       484.115 [ms] (mean, across all concurrent requests)
Transfer rate:          867.61 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    1   1.0      1      10
Processing:   142 39129 54677.9   7193  227810
Waiting:        0 8521 18450.7   1737  126830
Total:        143 39130 54677.8   7194  227811

Percentage of the requests served within a certain time (ms)
  50%   7194
  66%  17524
  75%  67984
  80%  116889
  90%  133112
  95%  133147
  98%  142428
  99%  179195
 100%  227811 (longest request)