ab-tests/pokijan.jpg/ab_multiprocessing_c150.txt
C:\xampp\apache\bin>ab -n 1000 -c 150 -s 86400 http://192.168.2.19:20001/pokijan.jpg
This is ApacheBench, Version 2.3 <$Revision: 1879490 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 192.168.2.19 (be patient)
Completed 100 requests
Completed 200 requests
Completed 300 requests
Completed 400 requests
Completed 500 requests
Completed 600 requests
Completed 700 requests
Completed 800 requests
Completed 900 requests
Completed 1000 requests
Finished 1000 requests


Server Software:        myserver/1.0
Server Hostname:        192.168.2.19
Server Port:            20001

Document Path:          /pokijan.jpg
Document Length:        15706 bytes

Concurrency Level:      150
Time taken for tests:   506.289 seconds
Complete requests:      1000
Failed requests:        276
   (Connect: 0, Receive: 0, Length: 276, Exceptions: 0)
Total transferred:      11472504 bytes
HTML transferred:       11371144 bytes
Requests per second:    1.98 [#/sec] (mean)
Time per request:       75943.395 [ms] (mean)
Time per request:       506.289 [ms] (mean, across all concurrent requests)
Transfer rate:          22.13 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    1   1.3      1      10
Processing:    45 43531 57711.8   5289  255989
Waiting:        0 6822 16092.1   1117  147507
Total:         46 43532 57711.7   5290  255989

Percentage of the requests served within a certain time (ms)
  50%   5290
  66%  36032
  75%  127943
  80%  130821
  90%  133007
  95%  134025
  98%  143226
  99%  143262
 100%  255989 (longest request)