ab-tests/pokijan.jpg/ab_multiprocessing_c150.txt
C:\xampp\apache\bin>ab -n 1000 -c 150 -s 86400 http://192.168.2.19:20001/rfc2616.pdf
This is ApacheBench, Version 2.3 <$Revision: 1879490 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 192.168.2.19 (be patient)
Completed 100 requests
Completed 200 requests
Completed 300 requests
Completed 400 requests
Completed 500 requests
Completed 600 requests
Completed 700 requests
Completed 800 requests
Completed 900 requests
Completed 1000 requests
Finished 1000 requests


Server Software:        myserver/1.0
Server Hostname:        192.168.2.19
Server Port:            20001

Document Path:          /rfc2616.pdf
Document Length:        550562 bytes

Concurrency Level:      150
Time taken for tests:   410.672 seconds
Complete requests:      1000
Failed requests:        267
   (Connect: 0, Receive: 0, Length: 267, Exceptions: 0)
Total transferred:      403668964 bytes
HTML transferred:       403561946 bytes
Requests per second:    2.44 [#/sec] (mean)
Time per request:       61600.869 [ms] (mean)
Time per request:       410.672 [ms] (mean, across all concurrent requests)
Transfer rate:          959.91 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    1   1.3      1      10
Processing:   214 43233 55316.0   8640  229315
Waiting:        0 7696 15813.1   2012   94697
Total:        215 43234 55316.0   8640  229316

Percentage of the requests served within a certain time (ms)
  50%   8640
  66%  34867
  75%  108460
  80%  112641
  90%  131599
  95%  133111
  98%  134279
  99%  223723
 100%  229316 (longest request)