ab-tests/pokijan.jpg/ab_multiprocessing_c200.txt
C:\xampp\apache\bin>ab -n 1000 -c 200 -s 86400 http://192.168.2.19:20001/pokijan.jpg
This is ApacheBench, Version 2.3 <$Revision: 1879490 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 192.168.2.19 (be patient)
Completed 100 requests
Completed 200 requests
Completed 300 requests
Completed 400 requests
Completed 500 requests
Completed 600 requests
Completed 700 requests
Completed 800 requests
Completed 900 requests
Completed 1000 requests
Finished 1000 requests


Server Software:        myserver/1.0
Server Hostname:        192.168.2.19
Server Port:            20001

Document Path:          /pokijan.jpg
Document Length:        15706 bytes

Concurrency Level:      200
Time taken for tests:   344.145 seconds
Complete requests:      1000
Failed requests:        313
   (Connect: 0, Receive: 0, Length: 313, Exceptions: 0)
Total transferred:      10886202 bytes
HTML transferred:       10790022 bytes
Requests per second:    2.91 [#/sec] (mean)
Time per request:       68829.059 [ms] (mean)
Time per request:       344.145 [ms] (mean, across all concurrent requests)
Transfer rate:          30.89 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    1   1.4      1      14
Processing:    36 49793 61546.1   8244  287815
Waiting:        0 7806 18090.1    915  122245
Total:         37 49794 61546.0   8245  287816

Percentage of the requests served within a certain time (ms)
  50%   8245
  66%  69347
  75%  118327
  80%  118837
  90%  133100
  95%  135898
  98%  176425
  99%  226450
 100%  287816 (longest request)