ab-tests/pokijan.jpg/ab_multiprocessing_c200.txt
C:\xampp\apache\bin>ab -n 1000 -c 200 -s 86400 http://192.168.2.19:20001/rfc2616.pdf
This is ApacheBench, Version 2.3 <$Revision: 1879490 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 192.168.2.19 (be patient)
Completed 100 requests
Completed 200 requests
Completed 300 requests
Completed 400 requests
Completed 500 requests
Completed 600 requests
Completed 700 requests
Completed 800 requests
Completed 900 requests
Completed 1000 requests
Finished 1000 requests


Server Software:        myserver/1.0
Server Hostname:        192.168.2.19
Server Port:            20001

Document Path:          /rfc2616.pdf
Document Length:        550562 bytes

Concurrency Level:      200
Time taken for tests:   354.745 seconds
Complete requests:      1000
Failed requests:        323
   (Connect: 0, Receive: 0, Length: 323, Exceptions: 0)
Total transferred:      372829316 bytes
HTML transferred:       372730474 bytes
Requests per second:    2.82 [#/sec] (mean)
Time per request:       70948.994 [ms] (mean)
Time per request:       354.745 [ms] (mean, across all concurrent requests)
Transfer rate:          1026.35 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    1   1.2      1      11
Processing:   230 51224 60011.4  10878  240663
Waiting:        0 6426 16152.9   1505  132214
Total:        230 51225 60011.4  10879  240666

Percentage of the requests served within a certain time (ms)
  50%  10879
  66%  68399
  75%  117739
  80%  130447
  90%  133104
  95%  134362
  98%  179191
  99%  217513
 100%  240666 (longest request)