ab-tests/pokijan.jpg/ab_multiprocessing_c50.txt
C:\xampp\apache\bin>ab -n 1000 -c 50 -s 86400 http://192.168.2.19:20001/pokijan.jpg
This is ApacheBench, Version 2.3 <$Revision: 1879490 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 192.168.2.19 (be patient)
Completed 100 requests
Completed 200 requests
Completed 300 requests
Completed 400 requests
Completed 500 requests
Completed 600 requests
Completed 700 requests
Completed 800 requests
Completed 900 requests
Completed 1000 requests
Finished 1000 requests


Server Software:        myserver/1.0
Server Hostname:        192.168.2.19
Server Port:            20001

Document Path:          /pokijan.jpg
Document Length:        15706 bytes

Concurrency Level:      50
Time taken for tests:   592.536 seconds
Complete requests:      1000
Failed requests:        153
   (Connect: 0, Receive: 0, Length: 153, Exceptions: 0)
Total transferred:      13421562 bytes
HTML transferred:       13302982 bytes
Requests per second:    1.69 [#/sec] (mean)
Time per request:       29626.821 [ms] (mean)
Time per request:       592.536 [ms] (mean, across all concurrent requests)
Transfer rate:          22.12 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    1   1.1      1      10
Processing:    25 26648 46760.1   3182  179196
Waiting:        0 6555 14554.3   1337  123683
Total:         26 26649 46760.1   3182  179199

Percentage of the requests served within a certain time (ms)
  50%   3182
  66%   8191
  75%  18256
  80%  37830
  90%  131545
  95%  133115
  98%  133573
  99%  133998
 100%  179199 (longest request)